; domain
(define (domain ranchyard)
(:requirements :typing :fluents)
(:types range range_asset - object
  homestead outpost - range
        wagon lariat platform - range_asset
        skid bale - platform)

(:predicates (grazing_at ?x - range_asset ?y - range)
             (stacked_on ?x - bale ?y - platform)
             (loaded_in ?x - bale ?y - wagon)
             (hauling ?x - lariat ?y - bale)
             (ready ?x - lariat)
             (bare ?x - platform)
)

(:functions
  (wagon_cap ?t - wagon)
  (current_haul ?t - wagon)
  (mass ?c - bale)
  (feed-cost)
)

(:action mosey
:parameters (?x - wagon ?y - range ?z - range)
:precondition (and (grazing_at ?x ?y))
:effect (and (not (grazing_at ?x ?y)) (grazing_at ?x ?z)
    (increase (feed-cost) 10)))

(:action rope_up
:parameters (?x - lariat ?y - bale ?z - platform ?p - range)
:precondition (and (grazing_at ?x ?p) (ready ?x) (grazing_at ?y ?p) (stacked_on ?y ?z) (bare ?y))
:effect (and (not (grazing_at ?y ?p)) (hauling ?x ?y) (not (bare ?y)) (not (ready ?x))
             (bare ?z) (not (stacked_on ?y ?z)) (increase (feed-cost) 1)))

(:action rope_down
:parameters (?x - lariat ?y - bale ?z - platform ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (bare ?z) (hauling ?x ?y))
:effect (and (ready ?x) (not (hauling ?x ?y)) (grazing_at ?y ?p) (not (bare ?z)) (bare ?y)
    (stacked_on ?y ?z)))

(:action wrangle_in
:parameters (?x - lariat ?y - bale ?z - wagon ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (hauling ?x ?y)
    (<= (+ (current_haul ?z) (mass ?y)) (wagon_cap ?z)))
:effect (and (not (hauling ?x ?y)) (loaded_in ?y ?z) (ready ?x)
    (increase (current_haul ?z) (mass ?y))))

(:action wrangle_out
:parameters (?x - lariat ?y - bale ?z - wagon ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (ready ?x) (loaded_in ?y ?z))
:effect (and (not (loaded_in ?y ?z)) (not (ready ?x)) (hauling ?x ?y)
    (decrease (current_haul ?z) (mass ?y))))

)

; problem
(define (problem ranchyard-p05) (:domain ranchyard)
(:objects
  homestead0 - homestead
  outpost0 - outpost
  wagon0 - wagon
  skid0 skid1 - skid
  bale0 bale1 - bale
  lariat0 lariat1 - lariat)
(:init
  (grazing_at skid0 homestead0)
  (bare bale0)
  (grazing_at skid1 outpost0)
  (bare bale1)
  (grazing_at wagon0 homestead0)
  (= (current_haul wagon0) 0)
  (= (wagon_cap wagon0) 100)
  (grazing_at lariat0 homestead0)
  (ready lariat0)
  (grazing_at lariat1 outpost0)
  (ready lariat1)
  (grazing_at bale0 homestead0)
  (stacked_on bale0 skid0)
  (= (mass bale0) 5)
  (grazing_at bale1 outpost0)
  (stacked_on bale1 skid1)
  (= (mass bale1) 7)
  (= (feed-cost) 0)
)

(:goal (and
    (stacked_on bale0 skid1)
  )
)

(:metric minimize (total-time)))

; plan
1. (rope_up lariat0 bale0 skid0 homestead0)
   deleted: (grazing_at bale0 homestead0) (bare bale0) (ready lariat0) (stacked_on bale0 skid0)
   added: (hauling lariat0 bale0) (bare skid0)
   changed: (feed-cost) from 0 to 1
   goals met: 0 of 1
2. (wrangle_in lariat0 bale0 wagon0 homestead0)
   deleted: (hauling lariat0 bale0)
   added: (loaded_in bale0 wagon0) (ready lariat0)
   changed: (current_haul wagon0) from 0 to 5
   goals met: 0 of 1
3. (mosey wagon0 homestead0 outpost0)
   deleted: (grazing_at wagon0 homestead0)
   added: (grazing_at wagon0 outpost0)
   changed: (feed-cost) from 1 to 11
   goals met: 0 of 1
4. (rope_up lariat1 bale1 skid1 outpost0)
   deleted: (grazing_at bale1 outpost0) (bare bale1) (ready lariat1) (stacked_on bale1 skid1)
   added: (hauling lariat1 bale1) (bare skid1)
   changed: (feed-cost) from 11 to 12
   goals met: 0 of 1
5. (wrangle_in lariat1 bale1 wagon0 outpost0)
   deleted: (hauling lariat1 bale1)
   added: (loaded_in bale1 wagon0) (ready lariat1)
   changed: (current_haul wagon0) from 5 to 12
   goals met: 0 of 1
6. (wrangle_out lariat1 bale0 wagon0 outpost0)
   deleted: (loaded_in bale0 wagon0) (ready lariat1)
   added: (hauling lariat1 bale0)
   changed: (current_haul wagon0) from 12 to 7
   goals met: 0 of 1
7. (rope_down lariat1 bale0 skid1 outpost0)
   deleted: (hauling lariat1 bale0) (bare skid1)
   added: (ready lariat1) (grazing_at bale0 outpost0) (bare bale0) (stacked_on bale0 skid1)
   goals met: 1 of 1
